/*
Post-Deployment Script Template							
--------------------------------------------------------------------------------------
 This file contains SQL statements that will be appended to the build script.		
 Use SQLCMD syntax to include a file in the post-deployment script.			
 Example:      :r .\myfile.sql								
 Use SQLCMD syntax to reference a variable in the post-deployment script.		
 Example:      :setvar TableName MyTable							
               SELECT * FROM [$(TableName)]					
--------------------------------------------------------------------------------------
*/

set IDENTITY_INSERT dbo.[Permissions] on

insert into dbo.[Permissions](Id, [Description]) values
	(1, N'View admin page'),
	(2, N'View students HR page'),
	(3, N'View auto mechanical faculty page'),
	(4, N'View engineering faculty page'),
	(5, N'View civil engineering faculty page'),
	(6, N'View economics page'),
	(7, N'View electrotechnical faculty page'),
	(8, N'View correspondence faculty page'),
	(9, N'View engineering and economics faculty page'),
	(10, N'View educational and methodical department page'),
	(11, N'Create proposals');

set IDENTITY_INSERT dbo.[Permissions] off
----------------------------------------
set IDENTITY_INSERT dbo.Users on

insert into dbo.Users(Id, Name, [Login], IsActive) values
	(1, N'Ruslan', 'minsk\ruslan_kutynko', 1);

set IDENTITY_INSERT dbo.Users off
----------------------------------------
set IDENTITY_INSERT dbo.Roles on

insert into dbo.Roles(Id, Name, [Description]) values
	(1, 'Admin', null);

set IDENTITY_INSERT dbo.Roles off
----------------------------------------
insert into dbo.Roles_2_Users values (1, 1);
----------------------------------------
insert into dbo.Permissions_2_Roles values (1, 1);


set IDENTITY_INSERT dbo.Actions on
insert into dbo.Actions(Id, [Description], IsBatch, Fields) values
	(1, N'Назначение паспортных данных', 1, N''),
	(2, N'Изменение паспортных данных', 1, N''),
	(3, N'Подача документов абитуриентом', 1, N''),
	(4, N'Зачислить как успешно сдавшего вступительные испытания', 1, N'<Fields><Field caption="Коментарий" type="System.String" /><Field caption="Специальность" type="Contingent.Lookup[Contingent.Profession]" /><Field caption="Зачислить с" type="System.Datetime" /></Fields>'),
	(5, N'Перевести с другой специальности', 1, N''),
	(6, N'Отчислить по академической неуспеваемости', 1, N''),
	(7, N'Отчислить по собственному желанию', 1, N''),
	(8, N'Перевести из другого учебного заведения', 1, N''),
	(9, N'Восстановить', 1, N''),
	(10, N'Отчислить в порядке перевода', 1, N''),
	(11, N'Академический отпуск', 1, N''),
	(20, N'Бюджетное обучение', 1, N''),
	(21, N'Платное обучение (собственные)', 1, N''),
	(22, N'Платное обучение (организация)', 1, N''),
	(25, N'Бюджетное обучение -40%', 1, N''),
	(26, N'Бюджетное обучение -60%', 1, N''),
	(27, N'Бюджетное обучение -15%', 1, N''),
	(28, N'Бюджетное обучение -20%', 1, N''),
	(50, N'Заселить в общежитие', 1, N''),
	(51, N'Выселить из общежития', 1, N''),
	(100, N'Назначить стипендию', 1, N''),
	(101, N'Отменить стипендию', 1, N''),
	(200, N'Отпуск по уходу за ребенком до достижения им возраста трех лет', 1, N''),
	(201, N'Отпуск для прохождения воинской службы', 1, N''),
	(202, N'Академический отпуск в связи с призывом на службу в резерве', 1, N''),
	(203, N'Отчислить за систематическое неисполнение обязанностей студента', 1, N''),
	(204, N'Академический отпуск по медицинским показаниям', 1, N''),
	(205, N'Расторгнуть договор о подготовке специалиста', 1, N''),
	(206, N'Заключить договор о подготовке специалиста', 1, N''),
	(207, N'Отчислить за привлечение к уголовной ответсвенности', 1, N''),
	(208, N'Отчислить, как непрошедшего итоговую аттестацию без уважительных причин', 1, N''),
	(209, N'Установить срок ликвидации разницы в учебных планах', 1, N''),
	(210, N'Возвратить из академического отпуска', 1, N''),
	(211, N'Назначить именную стипендию', 1, N''),
	(212, N'Наложить взыскание', 1, N''),
	(213, N'Продление академического отпуска', 1, N''),
	(214, N'Снять оплату за проживаине в общежитии', 1, N''),
	(215, N'Зачислить на государственное обеспечение', 1, N''),
	(216, N'Снять с государственного обеспечения', 1, N''),
	(217, N'Выплатить на ежегодное поплнение (на приобретение одежды, обуви)', 1, N''),
	(218, N'Назначить оплату за проживаине в общежитии', 1, N''),
	(219, N'Перевести в другое учебное заведение', 1, N''),
	(220, N'Возвратить из  отпуска', 1, N'');
set IDENTITY_INSERT dbo.Actions off

set IDENTITY_INSERT dbo.Reasons on
insert into dbo.Reasons(Id, [Description], Fields) values
	(1, N'Заявление', N''),
	(2, N'Представление', N'<Fields><Field caption="Коментарий" type="System.String" /><Field caption="Номер" type="System.String" /><Field caption="От" type="System.Datetime" /></Fields>'),
	(3, N'Справка', N''),
	(4, N'Удостоверение', N''),
	(5, N'Копия военного билета', N''),
	(6, N'Предписание', N''),
	(7, N'Согласие декана', N''),
	(8, N'Согласие деканов', N''),
	(9, N'Согласие родителей', N''),
	(10, N'Копия свидетельства о заключении брака', N''),
	(11, N'Договор', N''),
	(12, N'Повестка', N''),
	(13, N'Копия свидетельства о рассторжении брака', N''),
	(14, N'Копия свидетельства о рождении ребенка', N''),
	(15, N'Объяснительная', N''),
	(16, N'Подтверждение о трудоустройстве', N''),
	(17, N'Заключение ВКК', N''),
	(18, N'Аттестат', N''),
	(19, N'Докладная записка воспитателя', N''),
	(20, N'Копия свидетельства о перемене имени/фамилии/отчества', N''),
	(21, N'Копия удостоверения инвалида', N''),
	(22, N'Копия удостоверения пострадавшего от катастрофы на чернобыльской АЭС', N''),
	(23, N'Копия трудовой книжки', N''),
	(24, N'Медицинское заключение', N''),
	(25, N'Медицинская справка установленного образца', N''),
	(26, N'Оригинал документов о среднем образовании', N''),
	(27, N'Письмо учреждения', N''),
	(28, N'Письмо организации (предприятия)', N''),
	(29, N'Постановление Совета Министров РБ о государственном обеспечении детей-сирот, детей, оставшихся без попечения родителй', N''),
	(30, N'Представление декана', N''),
	(31, N'Справка об обучении', N''),
	(32, N'Докладная записка', N''),
	(33, N'Больничный лист', N''),
	(34, N'Справка из воинской части', N''),
	(35, N'Отсрочка прохождения воинской службы', N'');
set IDENTITY_INSERT dbo.Reasons off
